{
  "name": "Chosen of the Elementals",
  "source": "TCP",
  "className": "Conduit",
  "classSource": "TCP",
  "level": 20,
  "entries": [
    "Atop the hierarchy of elementals lies the {@creature Leviathan|MPMM}, {@creature Zaratan|MPMM}, {@creature Phoenix|MPMM}, and {@creature Elder Tempest|MPMM}. Each of these legendary creatures recognizes your power, and has granted you a boon. If a boon requires a saving throw, the DC is 8 + Wisdom modifier + Proficiency Bonus.",
    {
      "type": "item",
      "name": "Leviathan",
      "entries": [
        "As an action, you create a wave of water that extends from a point you can see within 120. The wave is up to 250 feet long, up to 250 feet tall, and up to 50 feet wide. Each hostile creature in the wave must make a Strength saving throw. On a failed save, a creature takes {@damage 7d12} bludgeoning damage and is knocked {@condition prone}. On a successful save, a creature takes half as much damage and isn't knocked {@condition prone}. The water spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 250 feet of it, and then it vanishes. Once you use this boon, you cannot do so again for 1 week."
      ]
    },
    {
      "type": "item",
      "name": "Zaratan",
      "entries": [
        "As an action, you conjure a shell of rock. Until the start of your next turn, you are resistant to all damage and are {@condition restrained}. At the start of your next turn, you regain {@dice 8d10} hit points and are no longer {@condition restrained}. Once you have used this feature you cannot do so again until you have finished a long rest."
      ]
    },
    {
      "type": "item",
      "name": "Phoenix",
      "entries": [
        "When you die, your body explodes into a burst of flame. Each hostile creature in a 60-foot-radius around you must make a Dexterity saving throw, taking {@damage 4d10} fire damage on a failed save, or half as much on a successful one. Instead of dying, you are restored to life with half of your hit point maximum. Once you have used this boon, you cannot use it again for one year."
      ]
    },
    {
      "type": "item",
      "name": "Elder Tempest",
      "entries": [
        "Each hostile creature within 120 feet of you must make a Dexterity saving throw, taking {@damage 6d8} lightning damage on a failed save, or half as much damage on a successful one. If a target's saving throw fails by 5 or more, the creature is also {@condition stunned} until the end of its next turn. Once you have used this boon you cannot use it again until you finish a short or long rest."
      ]
    }
  ]
}
